SIZE = (70, 70)
SIZE_TO_CROP = (3, 3, 67, 67)
SIZE_INPUT_LAYER = (64, 64, 3)

class_names = ["K", "Q", "R", "B", "N", "P", "0", "p", "n", "b", "r", "q", "k"]
class_names_rus = [
    "Белый король",
    "Белый ферзь",
    "Белая ладья",
    "Белый слон",
    "Белый конь",
    "Белая пешка",
    "Пусто",
    "Черная пешка",
    "Черный конь",
    "Черный слон",
    "Черная ладья",
    "Черный ферзь",
    "Черный король",
]
class_names_vice_versa = {
    "K": 0,
    "Q": 1,
    "R": 2,
    "B": 3,
    "N": 4,
    "P": 5,
    "0": 6,
    "p": 7,
    "n": 8,
    "b": 9,
    "r": 10,
    "q": 11,
    "k": 12,
}
